load-test-api.yml
config:
  target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 3
      name: "Warm up phase"
    - duration: 60
      arrivalRate: 3
      rampTo: 5
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 5
      rampTo: 10
      name: "Spike phase"
  defaults:
    headers:
      User-Agent: "Artillery API Load Test"
  # Useful plugins for monitoring metrics and performance requirements
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  # Apdex threshold (milliseconds)
  # apdex:
  #   threshold: 100
  # Ensure response times stay within these limits
  # ensure:
  #   thresholds:
  #     - http.response_time.p99: 200
  #     - http.response_time.p95: 150

scenarios:
  - name: "API Article Endpoints"
    flow:
      - get:
          url: "/api/articles/21?depth=1&draft=false&locale=fi"
      - think: 2
      - get:
          url: "/api/articles?depth=0&limit=20&locale=fi"

  - name: "API Content Testing"
    flow:
      - get:
          url: "/api/globals/front-page?depth=1&draft=false&locale=fi"
      - think: 2
      - get:
          url: "/api/globals/main-menu?depth=1&draft=false&locale=fi"
      - think: 2
      - get:
          url: "/api/globals/footer?depth=1&draft=false&locale=fi"
      - think: 2
      - get:
          url: "/api/globals/footer-menu?depth=1&draft=false&locale=fi"

  - name: "API Performance Testing"
    flow:
      - loop:
          - get:
              url: "/api/articles/21?depth=1&draft=false&locale=fi"
          - think: 1
          - get:
              url: "/api/articles?depth=0&limit=20&locale=fi"
          - think: 1
          - get:
              url: "/api/globals/main-menu?depth=1&draft=false&locale=fi"
          - think: 1
        count: 5