load-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 3
      name: "Warm up phase"
    - duration: 60
      arrivalRate: 3
      rampTo: 5
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 5
      rampTo: 10
      name: "Spike phase"
  defaults:
    headers:
      User-Agent: "Artillery Load Test"
  # Useful plugins for monitoring metrics and performance requirements
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  # Apdex threshold (milliseconds)
  # apdex:
  #   threshold: 100
  # Ensure response times stay within these limits
  # ensure:
  #   thresholds:
  #     - http.response_time.p99: 200
  #     - http.response_time.p95: 150

scenarios:
  - name: "Browse articles"
    flow:
      - loop:
          - get:
              url: "/fi/articles"
          - think: 5
          - get:
              url: "/fi/articles/article-8"
          - think: 3
          - get:
              url: "/fi/articles/article-7"
          - think: 4
          - get:
              url: "/fi/"
        count: 3